label start:

    scene Roy_walking

    play music "background_music/piano_background.mp3"

    "Сегодняшнее утро было на удивление приятным."

    "Несмотря на немного пасмурное, по осеннему хмурое небо, предрекающее дождь, я с удовольствием прогуливался по улице. Ветер путался в моих волосах, гонял по небу
    листья клена, которые дети любят собирать для гербария."

    "Запахнув поплотнее любимую красную ветровку,доставшуюся от дедушки, я включил свой плеер."
    
    "В наушниках неизменно играла любимая музыка"

    menu:

        "*Рок*":

            "Недавно группа Kirvana выпустила новый альбом."

            play music "background_music/rock_music.mp3" volume 0.06

        "*Хип-хоп*":

            "Недавно Snoop Cat выпустил новый альбом."

            play music "background_music/hip-hop_music.mp3" volume 0.06

        "*Поп-музыка*":

            "Недавно Майкл Брексон выпустил новый альбом."

            play music "background_music/pop_music.mp3" volume 0.06

    "Все звуки в миг стихли, сменяясь привычной мелодией.Я зашагал ей в такт, отбивая ритм пальцем по плееру."

    "Сегодня - мой долгожданный выходной, поэтому в планах было только наслаждаться осенним утром Портленда."

    "Редкие прохожие размеренно плыли мимо, пока я утопал в мыслях о том, что бы приготовить на ужин."
    
    "Наткнувшись взглядом на булочную, которая мне нравится не только за свежий хлеб, но и за приятного общительного продавца, я
    решил зайти внутрь."

    scene bakery

    "С минуту подумав о том, что хочу взять, я остановился на привычном варианте - чесночный хлеб
    и пару творожных ватрушек."

    News "Сегодня в 9 часу произошла чудовищная авария в штате Буфорд - обнаружено трое
    погибших, более 10 человек в тяжелом состоянии доставлены в реанимацию..."

    return
