label rudy_screamer_1:

    "Я решился попрощаться с Руди в последний раз"

    "Для этого я и приехал, в конце концов."

    scene rudy_funeral with dissolve

    "На негнущихся ногах я подошёл к гробу."

    "Руди выглядел так, будто спал, и если его хорошенько 
    растормошить, как в детстве перед школой, то он с наигранным 
    ворчанием встанет и побежит по делам."

    "Но от моего прикосновения ничего не изменилось."

    "Постояв так пару минут и проведя внутренний диалог 
    с другом, я отвернулся чтобы покинуть церковь."

    # резкий, страшный звук

    # нагнетающая музыка

    scene rudy_screamer_1 with hpunch

    "Меня схватил чья-то рука. Обернувшись, я наткнулся на два 
    сияющих белых глаза, что когда-то скрывали в себе задорную улыбку."

    "Синие губы застыли в беззвучном хрипе, а по углам слышался 
    безумный хохот, сводящий с ума."

    "Увиденное тут же въелось в сетчатку, не давая и шанса забыть об этом, 
    обещая приследовать по ночам."

    Roy "*Что..?*"

    "Вырвать руку не удавалось. Руди, или кто сейчас бы не лежал на его месте, 
    держал меня с нечеловеческой силой."

    "Никто не обратил на это внимания. Ни меня, ни гроба будто не существовало 
    для остальных."

    "Я хотел закричать, но из горла не вырвалось ни одного звука."

    Rudy "Наконец... мы дождались тебя..."

    scene funeral_hall with dissolve

    "После этого мертвая хватка ослабла, и я, запнувшись об свою штанину, упал на пол."

    "Из-за громкого шлепка все обернулись на меня."

    Roy "*Неловко...*"

    scene rudy_funeral_2 with fade

    "Я быстро поднялся и обнаружил Руди таким же, как и до моего прихода."

    "Это видение выбило почву из под ног, но, по крайней мере, помогло отвлечься 
    от призрака прошлого, но я все равно поторопился на выход."

    # Уведомление *Произошедшее натолкнуло Роя на размышления.*

    Roy "*Показалось..?*"

    return

label rudy_screamer_2:

    "Не дожидаясь, пока вереница гостей перед гробом опустеет, 
    я поднялся с места, случайно поймав взгляд Миссис Волфорд."
    
    "Она спешно отвернулась, пряча грусть и мимолетное разочарование."

    Roy "*Ну... заслужено.*"

    "Я тоже поспешил отвернуться, скользя взглядом по гостям, пока ждал, 
    что проход освободиться, чтобы скорее покинуть это душное помещение."

    # резкий, страшный звук

    # нагнетающая музыка

    return 